SM_для_EDT/src/Documents/vftАнализСУБ/vftАнализСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>vftАнализСУБ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодИсполненияОбязанностейС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодИсполненияОбязанностейПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяЭффективностьСудовойСУБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийЭффективностьСудовойСУБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Предложения</name>
    <attributes>
      <name>Суб</name>
      <type>
        <types>CatalogRef.vftСУБ</types>
      </type>
    </attributes>
    <attributes>
      <name>НетПредложения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предложение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветКомпании</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеПодразделение</name>
      <type>
        <types>CatalogRef.vftПодразделенияКомпании</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/vftСтатусыДокументовСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументовСообщений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Инициировано</name>
  </enumValues>
  <enumValues>
    <name>Проведено</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаСудно</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Доработан</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Enums/рарусТипыДокументацииСУБ/рарусТипыДокументацииСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рарусТипыДокументацииСУБ</name>
  <enumValues>
    <name>ДокументацияСУБ</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Catalogs/vftСУБ/vftСУБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftСУБ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаСУБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.рарусТипыДокументацииСУБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеПодразделение</name>
    <type>
      <types>CatalogRef.vftПодразделенияКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыФлота</name>
    <attributes>
      <name>ТипФлота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыСудов</name>
    <attributes>
      <name>ПроектСудна</name>
      <type>
        <types>CatalogRef.vftПроектыСудов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Суда</name>
    <attributes>
      <name>Судно</name>
      <type>
        <types>CatalogRef.vftСуда</types>
      </type>
    </attributes>
    <attributes>
      <name>Архив</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Documents/vftАнализСУБ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	//++ rarus isaeva 04.01.2020
	//Префикс =  Судно.КодБыстрогоВвода;
	Префикс = СформироватьПрефиксНомераДокумента();
	//-- rarus isaeva 04.01.2020

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	vftОбщиеПроцедурыДокументовСервер.ПриКопировании(ЭтотОбъект,ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	 МассивНепроверяемыхРеквизитов = Новый Массив;
	
	 Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		 
		 МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");
		 МассивНепроверяемыхРеквизитов.Добавить("ПериодИсполненияОбязанностейС");
		 МассивНепроверяемыхРеквизитов.Добавить("ПериодИсполненияОбязанностейПо");	 
		 	 
	 КонецЕсли;
	 
	 Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик
		 Или Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен Тогда
			 
		 МассивНепроверяемыхРеквизитов.Добавить("ОтветКомпании");
		 МассивНепроверяемыхРеквизитов.Добавить("Ответственный");
		 
	 КонецЕсли;
	 
	 Если Статус <> Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		 
		 Для ТекИндекс = 0 По Предложения.Количество()-1 Цикл
			 
			 АдресОшибки = " " + НСтр("ru = 'в строке %НомерСтроки% списка.';
			 |en = 'in line %НомерСтроки% of the ""Goods"" list'");
			 АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Предложения[ТекИндекс].НомерСтроки);
			 
			 СтрокаТаблицы = Предложения[ТекИндекс];
			 
			 Если Не (СтрокаТаблицы.НетПредложения Или Не ПустаяСтрока(СтрокаТаблицы.Предложение)) Тогда
				 
				 ТекстОшибки = НСтр("ru = 'Не заполнено предложение по улучшению СУБ. Заполните или укажите, что предложений нет ';
				 |en = 'You must specify cancellation reason'");
				 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				 ТекстОшибки + АдресОшибки,
				 ЭтотОбъект,
				 ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Предложения", Предложения[ТекИндекс].НомерСтроки, "Предложение"),
				 ,
				 Отказ);	 
				 
			 КонецЕсли;
			 
		 КонецЦикла;
		 
	 КонецЕсли;
	 
	 ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// ++ rarus ilshill 14.01.2020 № 26571
	
	// ++ Перенесена из обработчика приСозданииНаСервере
	Если Не ЗначениеЗаполнено(Ссылка) Тогда		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	vftСУБ.Ссылка КАК Суб
		|ИЗ
		|	Справочник.vftСУБ КАК vftСУБ
		|ГДЕ
		|	vftСУБ.Архивный = ЛОЖЬ
		|	И vftСУБ.ПометкаУдаления = ЛОЖЬ
		|	И (vftСУБ.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.рарусТипыДокументацииСУБ.ДокументацияСУБ)
		|			ИЛИ vftСУБ.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.рарусТипыДокументацииСУБ.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	vftСУБ.НомерДокументаСУБ";
		
		Предложения.Загрузить(Запрос.Выполнить().Выгрузить())
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда	
		рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);		
	КонецЕсли;

	// -- rarus ilshill 14.01.2020 № 26571
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПрефиксНомераДокумента() Экспорт
	
	Префикс = "";
	
	Префикс = Префикс + ?(Судно <> Справочники.vftСуда.ПустаяСсылка(), Судно.КодБыстрогоВвода, "      ");
	Префикс = Префикс + "-";
	Префикс = Префикс + ?(Дата = Дата("00010101000000"), "  ", Прав(Формат(Дата, "ДФ=yyyy"), 2));
	Префикс = Префикс + "-";
	
	Возврат Префикс;
	
КонецФункции

#КонецОбласти

#КонецЕсли
